atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
    // {Ref, ap_started}
    BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE, heap);
    {
        send_term(&heap, data, make_atom(data->global, ap_started_atom));
    }
    END_WITH_STACK_HEAP(heap, data->global);
}

static void send_atom_mac(struct ClientData *data, term atom, uint8_t *mac)
{
    // {Ref, {ap_connected | ap_disconnected, <<1,2,3,4,5,6>>}}
    BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(6), heap);
    {
        term mac_term = term_from_literal_binary(mac, 6, &heap, data->global);
        term reply = port_heap_create_tuple2(&heap, atom, mac_term);
        send_term(&heap, data, reply);
    }
    END_WITH_STACK_HEAP(heap, data->global);
}

static void send_ap_sta_connected(struct ClientData *data, uint8_t *mac)
{
    TRACE("Sending ap_sta_connected back to AtomVM\n");
    send_atom_mac(data, make_atom(data->global, ap_sta_connected_atom), mac);
}

static void send_ap_sta_disconnected(struct ClientData *data, uint8_t *mac)
{
    TRACE("Sending ap_sta_disconnected back to AtomVM\n");
    send_atom_mac(data, make_atom(data->global, ap_sta_disconnected_atom), mac);
}

static void send_ap_sta_ip_assigned(struct ClientData *data, esp_ip4_addr_t *ip)
{
    TRACE("Sending ap_sta_ip_assigned back to AtomVM\n");

    BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(4), heap);
    {
        term ip_term = tuple_from_addr(&heap, ntohl(ip->addr));
        term reply = port_heap_create_tuple2(&heap, make_atom(data->global, ap_sta_ip_assigned_atom), ip_term);
        send_term(&heap, data, reply);
    }
    END_WITH_STACK_HEAP(heap, data->global);
}

static void send_sntp_sync(struct ClientData *data, struct timeval *tv)
{
    TRACE("Sending sntp_sync back to AtomVM\n");

    // {Ref, {sntp_sync, {TVSec, TVUsec}}}
    BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) * 2 + BOXED_INT64_SIZE * 2, heap);
    {
        term tv_tuple = port_heap_create_tuple2(&heap, term_make_maybe_boxed_int64(tv->tv_sec, &heap), term_make_maybe_boxed_int64(tv->tv_usec, &heap));
        term reply = port_heap_create_tuple2(&heap, make_atom(data->global, sntp_sync_atom), tv_tuple);
        send_term(&heap, data, reply);
    }
    END_WITH_STACK_HEAP(heap, data->global);
}

static void send_scan_results(struct ClientData *data)
{
    uint16_t ap_count = 0;
    esp_wifi_scan_get_ap_num(&ap_count);
    ESP_LOGI(TAG, "Scan found %d APs", ap_count);

    if (ap_count == 0) {
        // Send empty list
        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2), heap);
        {
            term reply_tuple = term_alloc_tuple(2, &heap);
            term_put_tuple_element(reply_tuple, 0, make_atom(data->global, scan_results_atom));
            term_put_tuple_element(reply_tuple, 1, term_nil());
            send_term(&heap, data, reply_tuple);
        }
        END_WITH_STACK_HEAP(heap, data->global);
        return;
    }

    wifi_ap_record_t *ap_list = (wifi_ap_record_t *)malloc(sizeof(wifi_ap_record_t) * ap_count);
    if (IS_NULL_PTR(ap_list)) {
        ESP_LOGE(TAG, "Failed to allocate memory for scan results");
        return;
    }
    
    // Get the actual records. ap_count might be updated if fewer records are returned.
    ESP_ERROR_CHECK(esp_wifi_scan_get_ap_records(&ap_count, ap_list));
    ESP_LOGI(TAG, "Processing %d AP records", ap_count);

    size_t heap_size = PORT_REPLY_SIZE + TUPLE_SIZE(2);
    for (int i = 0; i < ap_count; i++) {
        heap_size += CONS_SIZE;
        heap_size += TUPLE_SIZE(5);
        // Ensure we don't read past 32 bytes for SSID
        size_t ssid_len = strnlen((char *)ap_list[i].ssid, 32);
        heap_size += TERM_BINARY_HEAP_SIZE(ssid_len);
        heap_size += TERM_BINARY_HEAP_SIZE(6);
    }

    ESP_LOGI(TAG, "Allocating heap size: %d", heap_size);

    // Add some padding to be safe
    heap_size += 64;

    Heap heap;
    if (UNLIKELY(memory_init_heap(&heap, heap_size) != MEMORY_GC_OK)) {
        ESP_LOGE(TAG, "Unable to allocate heap space for scan results");
        free(ap_list);
        return;
    }

    term list = term_nil();
    for (int i = ap_count - 1; i >= 0; i--) {
        size_t ssid_len = strnlen((char *)ap_list[i].ssid, 32);
        term ssid_term = term_from_literal_binary(ap_list[i].ssid, ssid_len, &heap, data->global);
        term rssi_term = term_from_int(ap_list[i].rssi);
        term channel_term = term_from_int(ap_list[i].primary);
        term authmode_term = term_from_int(ap_list[i].authmode);
        term bssid_term = term_from_literal_binary(ap_list[i].bssid, 6, &heap, data->global);

        term tuple = term_alloc_tuple(5, &heap);
        term_put_tuple_element(tuple, 0, ssid_term);
        term_put_tuple_element(tuple, 1, rssi_term);
        term_put_tuple_element(tuple, 2, channel_term);
        term_put_tuple_element(tuple, 3, authmode_term);
        term_put_tuple_element(tuple, 4, bssid_term);

        list = term_list_prepend(tuple, list, &heap);
    }
    free(ap_list);

    term reply_tuple = term_alloc_tuple(2, &heap);
    term_put_tuple_element(reply_tuple, 0, make_atom(data->global, scan_results_atom));
    term_put_tuple_element(reply_tuple, 1, list);

    send_term(&heap, data, reply_tuple);
    ESP_LOGI(TAG, "Scan results sent");

    memory_destroy_heap(&heap, data->global);
}

#define UNLIKELY_NOT_ESP_OK(E) UNLIKELY((E) != ESP_OK)

//
// Event Handler
//

static void event_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
{
    struct ClientData *data = (struct ClientData *) arg;

    if (event_base == WIFI_EVENT) {

        switch (event_id) {

            case WIFI_EVENT_STA_START: {
                ESP_LOGI(TAG, "WIFI_EVENT_STA_START received.");
                esp_wifi_connect();
                break;
            }

            case WIFI_EVENT_STA_CONNECTED: {
                ESP_LOGI(TAG, "WIFI_EVENT_STA_CONNECTED received.");
                send_sta_connected(data);
                break;
            }

            case WIFI_EVENT_STA_DISCONNECTED: {
                ESP_LOGI(TAG, "WIFI_EVENT_STA_DISCONNECTED received.");
                esp_wifi_connect();
                send_sta_disconnected(data);
                break;
            }

            case WIFI_EVENT_AP_STACONNECTED: {
                ESP_LOGI(TAG, "WIFI_EVENT_AP_STACONNECTED received.");
                wifi_event_ap_staconnected_t *event = (wifi_event_ap_staconnected_t *) event_base;
                send_ap_sta_connected(data, event->mac);
                break;
            }

            case WIFI_EVENT_AP_STADISCONNECTED: {
                ESP_LOGI(TAG, "WIFI_EVENT_AP_STADISCONNECTED received.");
                wifi_event_ap_stadisconnected_t *event = (wifi_event_ap_stadisconnected_t *) event_base;
                send_ap_sta_disconnected(data, event->mac);
                break;
            }

            case WIFI_EVENT_AP_START: {
                ESP_LOGI(TAG, "WIFI_EVENT_AP_START received.");
                send_ap_started(data);
                break;
            }

#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0))
            case WIFI_EVENT_HOME_CHANNEL_CHANGE: {
                wifi_event_home_channel_change_t *chan_data = (wifi_event_home_channel_change_t *) event_data;
                ESP_LOGD(TAG, "WIFI_EVENT home channel changed from %u to %u.", chan_data->old_chan, chan_data->new_chan);
                break;
            }
#endif

            case WIFI_EVENT_STA_BEACON_TIMEOUT: {
                ESP_LOGI(TAG, "WIFI_EVENT_STA_BEACON_TIMEOUT received. Maybe poor signal, or network congestion?");
                send_sta_beacon_timeout(data);
                break;
            }

            case WIFI_EVENT_SCAN_DONE: {
                ESP_LOGI(TAG, "WIFI_EVENT_SCAN_DONE received.");
                send_scan_results(data);
                break;
            }

            default:
                ESP_LOGI(TAG, "Unhandled wifi event: %" PRIi32 ".", event_id);
                break;
        }

    } else if (event_base == IP_EVENT) {

        switch (event_id) {

